import itertools

db = [(1522234274, 'игра первая', 10, 1, 235987482), (1522234526, 'игра вторая', 15, 1, 235987482),
      (1522234566, 'игра третья', 1, 1, 235987482), (1522236021, 'игра четвертая', 10, 1, 235987482),
      (1522246109, 'игра пятая', 15, 1, 235987482), (1522302092, 'игра шестая', 23, 1, 235987482),
      (1522305067, 'игра седьмая', 45, 1, 235987482), (1522305140, 'игра седьмая', 15, 1, 235987482),
      (1522305332, 'игра восьмая', 4, 1, 235987482), (1522307333, 'игра без номера', 4, 1, 235987482),
      (1522327834, 'тест игра', 4, 1, 235987482)]

call = 1522234274


#a = lambda call: call if call in db[0] else print('no')


def indb(db):
    l=[]
    for i in db:
        l.append(i[0])
    #print(l)
    return l

a = lambda call: True if call in indb(db) else False
#print(a(call))

#list(map(indb, db))
print(a)